Repository: GlobalesDev/PGPlanning
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# saludo
source: Welcome,
es: Buenos días,
pt: Bem-vindo,

# otroUsuario
source: Login with another user
es: Entrar con otro usuario
pt: Entrar com outro utilizador

# pistaEmail
source: Enter your email
es: Introduzca su email
pt: Introduza o seu e-mail

# cancelarBiometricos
source: The user has canceled the biometric login operation
es: El usuario ha cancelado la operacion de acceso mediante biométricos
pt: O utilizador cancelou a operação de entrada por biometria

# usoPass
source: Use password
es: Usar contraseña
pt: Usar palavra-passe

# usoPassAcceso
source: Enter the login password
es: Introduzca la contraseña de acceso
pt: Introduza a palavra-passe de entrada

# pistaPass
source: Enter your password
es: Introduzca su contraseña
pt: Introduza a sua palavra-passe

# pistaBiometricos
source: Swipe your finger across the sensor on your device
es: Pase el dedo por el sensor de su dispositivo
pt: Passe o dedo sobre o sensor do seu dispositivo

# usoBiometricos
source: Use biometrics
es: Usar biométricos
pt: Use biometria

# btnAcceso
source: Login
es: Acceder
pt: Entrar

# btnRecuperarPass
source: Recover password?
es: ¿Recuperar contraseña?
pt: Recuperar a palavra-passe?

# sincroDatos
source: Synchronizing data
es: Sincronizando datos
pt: A sincronizar dados

# recuperarSecciones
source: Retrieving data from sections.
es: Recuperando datos de secciones.
pt: A recuperar dados das secções.

# verificandoUser
source: Verifying data, please wait.
es: Verificando datos, por favor espere.
pt: A verificar dados, por favor aguarde.

# selectEmpresa
source: Select Employee
es: Seleccione Empleado
pt: Selecione Colaborador

source: Select Area
es: Seleccione Area
pt: Selecione a Área

# selectFile
source: Select Planning
es: Seleccione Planificacion
pt: Selecione a Planificação

# selectEmpleado
source: Select Employee
es: Seleccione Empleado
pt: Selecione o Colaborador

# aceptarM
source: ACCEPT
es: ACEPTAR
pt: ACEITAR

# aceptar
source: Accept
es: Aceptar
pt: Aceitar

source: User
es: Usuario
pt: Usuário

# empresa
source: Company
es: Empresa
pt: Empresa

source: Area
pt: Área

# planificacion
source: Planning
es: Planificación
pt: Planificação

# ultimaConexion
source: Last connection
es: Última conexión
pt: Última ligação

# inicioSesion
source: Login
es: Inicio sesión
pt: Entrar

# cerrarSesion
source: Logout
es: Cerrar sesión
pt: Sair

# cambiarClave
source: Change key
es: Cambiar clave
pt: Alterar chave

# cambiarPlan
source: Change planning
es: Cambiar plan
pt: Alterar planificação

# reconfigAuth2
source: Reconfigure 2-step aut.
es: Reconfigurar aut. 2-pasos
pt: Reconfigurar aut. 2-passos

# eliminarAuth2
source: Delete 2-step aut.
es: Eliminar aut. 2-pasos
pt: Eliminar aut. 2-passos

# inicio
source: Home
es: Inicio
pt: Início

# principal
source: Main
es: Principal
pt: Principal

# planificacionCaducada
source: This planning is no longer in effect (it has expired)
es: Esta planificación ya no esta en vigor (ha caducado)
pt: Esta planificação já não está em vigor (caducou)

# cambiarPlanificacion
source: Change planning
es: Cambiar planificación
pt: Alterar a planificação

# tituloCambioClave
source: Generate / Change download key
es: Generar / Cambiar clave de descarga
pt: Gerar / Alterar a chave de transferência

# cuerpoCambioClave
source: To generate/change your download key, you must enter the current password for accessing the employee portal and the new download key, twice. Remember that the new key must be at least 4 characters long.
es: Para generar/cambiar su clave de descarga, debe introducir la contraseña actual de acceso al portal del empleado y la nueva clave de descarga, por duplicado. Recuerde que la nueva clave debe ser de al menos 4 caracteres.
pt: Para gerar/alterar a sua chave de transferência, deve introduzir a palavra-passe atual de acesso ao portal do colaborador e a nova chave de transferência, duas vezes. Lembre-se de que a nova chave deve ter pelo menos 4 caracteres.

# contraUser
source: User's password
es: Contraseña de usuario
pt: Palavra-passe do utilizador

# claveDescarga
source: Download key
es: Clave descarga
pt: Chave de transferência

# repetirClave
source: Repeat key
es: Repetir clave
pt: Repetir a chave

# cancelar
source: Cancel
es: Cancelar
pt: Cancelar

# idioma
source: Language
es: Idioma
pt: Língua

# cargando
source: Loading...
es: Cargando...
pt: Carregamento...

# errorLogin
source: Login error
es: Error en el login
pt: Erro no login

source: Incorrect password
es: Contraseña incorrecta
pt: Palavra-passe incorreta

source: Passwords do not match
es: Las contraseñas no coinciden
pt: As palavras-passe não coincidem

# passwordRequirementsNotMet
source: Password does not meet requirements
es: La contraseña no cumple los requisitos
pt: A palavra-passe não cumpre os requisitos

# passwordRequirementsDetail
source: Password must be at least 8 characters, one uppercase, one lowercase, one number and one special character
es: La contraseña debe tener al menos 8 caracteres, una mayúscula, una minúscula, un número y un carácter especial
pt: A palavra-passe deve ter pelo menos 8 caracteres, uma maiúscula, uma minúscula, um número e um carácter especial

source: Change password
es: Cambio de contraseña
pt: Alterar palavra-passe

source: Close
es: Cerrar
pt: Fechar

# passwordChangedInfo
source: You must change your password to access the system.
es: Debe cambiar la contraseña para acceder al sistema.
pt: Tem de alterar a palavra-passe para aceder ao sistema.

source: Repeat password
es: Repetir contraseña
pt: Repetir palavra-passe

source: New password
es: Nueva contraseña
pt: Nova palavra-passe

# passwordNoSpaces
source: Password cannot contain spaces
es: La contraseña no puede contener espacios
pt: A palavra-passe não pode conter espaços

source: Processing...
es: Procesando...
pt: A processar...

# passwordExpired
source: Your password has expired.
es: Su contraseña ha caducado.
pt: A sua palavra-passe expirou.

source: Change
es: Cambiar
pt: Alterar

# errorRegisteringUser
source: An error occurred while registering the user, please try again. If the problem persists, contact support.
es: Ocurrió un error al registrar el usuario, vuelva a intentarlo y si el problema persiste contacte con soporte.
pt: Ocorreu um erro ao registar o utilizador, tente novamente e se o problema persistir contacte o suporte.

# userOrPassNotValid
source: The username and/or password are not valid.
es: El usuario y/o contraseña no son válidos.
pt: O utilizador e/ou palavra-passe não são válidos.

# unlockPassNotMatch
source: The password is not valid.
es: La contraseña no es válida.
pt: A palavra-passe não é válida.

# userAssociatedWithTokenNotFound
source: The user was not found or has expired, please log in again.
es: El usuario no ha sido encontrado o ha caducado, vuelva a logearse.
pt: O utilizador não foi encontrado ou expirou, volte a iniciar sessão.

# needUnlockWithPassword
source: A password unlock is required
es: Se necesita un un desbloqueo con contraseña
pt: É necessário desbloquear com palavra-passe

# errorEmailAndPasswordRequired
source: Enter an email and a password
es: Introduce un email y una contraseña
pt: Introduza um e-mail e uma palavra-passe

# errorEmailRequired
source: Enter an email
es: Introduce un email
pt: Introduza um e-mail

# errorPasswordRequired
source: Enter a password
es: Introduce una contraseña
pt: Introduza uma palavra-passe

# errorSessionExpired
source: Session expired
es: Sesion caducada
pt: Sessão expirada

# errorSessionMustLogin
source: Session has expired, you must log in again.
es: La sesión ha caducado, debe realizar un login completo.
pt: A sessão expirou, deve iniciar sessão novamente.

# errorLoginMethodNotRecognized
source: Login method not recognized
es: Metodo de login no reconocido
pt: Método de login não reconhecido

# errorCache
source: Cache error
es: Error de cache
pt: Erro de cache

# passwordUpdatedTitle
source: Password updated
es: Contraseña actualizada
pt: Senha atualizada

# passwordUpdatedText
source: Your password has been successfully updated, you can log in again with the new password.
es: Su contraseña ha sido actualizada satisfactoriamente, puede volver a logearse con la nueva contraseña.
pt: Sua senha foi atualizada com sucesso, você pode fazer login novamente com a nova senha.

# weakPasswordStrength
source: The new password does not meet the complexity requirements.
es: La nueva contraseña no cumple los requisitos de complejidad.
pt: A nova senha não atende aos requisitos de complexidade.

# errorSavingTryAgain
source: An error occurred while trying to save the new password.
es: Ha ocurrido un error al intentar guardar la nueva contraseña.
pt: Ocorreu um erro ao tentar salvar a nova senha.

# passwordRecentlyUsed
source: The new password does not meet the password history requirement.
es: La nueva contraseña no cumple el requisito de historico de contraseñas.
pt: A nova senha não atende ao requisito de histórico de senhas.

# newPasswordsNotMatch
source: The new password and its repetition do not match.
es: La nueva contraseña y su repeticion no coinciden.
pt: A nova senha e sua repetição não coincidem.

# userOrPassNotValidCurrent
source: The current password is not correct.
es: La actual contraseña no es correcta.
pt: A senha atual não está correta.

# errorNewPass
source: Error changing password
es: Error en el cambio de contraseña
pt: Erro ao alterar a senha
